# PaneId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockableFrameFocusChangedEventArgs..::..PaneId Property
DockableFrameFocusChangedEventArgs Class See Also
---
The identifier for dockable pane.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public DockablePaneId PaneId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PaneId As DockablePaneId
	Get
```

Visual C++
---
```text
public:
property DockablePaneId^ PaneId {
	DockablePaneId^ get ();
}
```

# See Also
DockableFrameFocusChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace